/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50714
Source Host           : localhost:3306
Source Database       : supermarket

Target Server Type    : MYSQL
Target Server Version : 50714
File Encoding         : 65001

Date: 2017-08-17 17:20:43
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for sup
-- ----------------------------
DROP TABLE IF EXISTS `sup`;
CREATE TABLE `sup` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `goodscode` varchar(255) DEFAULT NULL,
  `goodsname` varchar(255) DEFAULT NULL,
  `goodsnumber` varchar(255) DEFAULT NULL,
  `goodsstyle` varchar(255) DEFAULT NULL,
  `goodsnuit` varchar(255) DEFAULT NULL,
  `goodsprice` varchar(255) DEFAULT NULL,
  `menberprice` varchar(255) DEFAULT NULL,
  `goodsmodel` varchar(255) DEFAULT NULL,
  `time` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=34 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of sup
-- ----------------------------
INSERT INTO `sup` VALUES ('1', '6911006000052', '10kg国宝桥米', '001', '米类', '袋(件)', '78', '72', '1*10kg', '2017-08-15 16:41:07');
INSERT INTO `sup` VALUES ('2', '6911006000052', '10kg国宝桥米', '001', '米类', '袋(件)', '78', '72', '1*10kg', '2017-08-15 16:41:08');
INSERT INTO `sup` VALUES ('3', '6956416200390', '10kg屈家岭京山香米', '001', '米类', '包(件)', '53', '50.47', '1*10kg', '2017-08-15 16:42:50');
INSERT INTO `sup` VALUES ('4', '6948196600045', '10kg什湖特选东北大米', '001', '米类', '包(件)', '65', '64.89', '1*10袋', '2017-08-15 16:43:42');
INSERT INTO `sup` VALUES ('5', '6949931122273', '2.5kg大中厚家庭用小麦', '001', '米类', '包(件)', '12.5', '9.79', '1*10', '2017-08-15 16:45:16');
INSERT INTO `sup` VALUES ('6', '6949931122273', '2.5kg大中厚家庭用小麦', '	001', '米类', '包(件)', '12.5', '9.79', '1*10袋', '2017-08-15 16:46:10');
INSERT INTO `sup` VALUES ('7', '2820002000000', '25kg泰昌晚优金丝米（新版）', '001', '米类', '包(件)', '7.6', '7', '1*10袋', '2017-08-15 16:50:10');
INSERT INTO `sup` VALUES ('8', '2820004000000', '25kg仙桃（晚香）', '001', '米类', '包(件)', '7.6', '7', '1*10袋', '2017-08-15 16:50:34');
INSERT INTO `sup` VALUES ('9', '2820004000000', '25kg仙桃（晚香）', '001', '米类', '包(件)', '7.6', '7', '1*10袋', '2017-08-15 16:50:35');
INSERT INTO `sup` VALUES ('10', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:50:59');
INSERT INTO `sup` VALUES ('11', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:50:59');
INSERT INTO `sup` VALUES ('12', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:26');
INSERT INTO `sup` VALUES ('13', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:27');
INSERT INTO `sup` VALUES ('14', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:27');
INSERT INTO `sup` VALUES ('15', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:27');
INSERT INTO `sup` VALUES ('16', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:27');
INSERT INTO `sup` VALUES ('17', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:27');
INSERT INTO `sup` VALUES ('18', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:27');
INSERT INTO `sup` VALUES ('19', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:27');
INSERT INTO `sup` VALUES ('20', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:28');
INSERT INTO `sup` VALUES ('21', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:28');
INSERT INTO `sup` VALUES ('22', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:28');
INSERT INTO `sup` VALUES ('23', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:28');
INSERT INTO `sup` VALUES ('24', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:28');
INSERT INTO `sup` VALUES ('25', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:28');
INSERT INTO `sup` VALUES ('26', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:28');
INSERT INTO `sup` VALUES ('27', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:29');
INSERT INTO `sup` VALUES ('28', '6936928590207', '5kg屈家岭京山香米', '001', '米类', '包(件)', '6.8', '5', '1*10袋', '2017-08-15 16:51:29');
INSERT INTO `sup` VALUES ('29', null, null, null, null, null, null, null, null, '2017-08-15 17:55:36');
INSERT INTO `sup` VALUES ('30', '', '', '', '', '', '', '', '', '2017-08-15 18:09:48');
INSERT INTO `sup` VALUES ('31', 'q请问', '阿悄无二', '234', '34', '234', '123', '123', '123', '2017-08-16 10:23:09');
INSERT INTO `sup` VALUES ('32', 'abc', 'abc', 'abc', 'abc', 'abc', 'abc', 'abc', 'abc', '2017-08-17 15:34:42');
INSERT INTO `sup` VALUES ('33', '123', '123', '', '', '', '', '', '', '2017-08-17 15:40:28');
